const calculate = require('../calculate.js');
const exponentiation = calculate.exponentiation; 

describe("функция exponentiation()" , ()=>{
        // number
    it('должна возвращать 9 при аргументах (5 , 2)',()=>{ // описываем условия
        expect(exponentiation(5,2)) // передаем в функцию параментры
        .toBe(25); // передаем ожидаемый результат 
    })
    it('должна возвращать 1 при аргументах (10 , 0)',()=>{ // описываем условия
        expect(exponentiation(10,0)) // передаем в функцию параментры
        .toBe(1); // передаем ожидаемый результат 
    })
    it('должна возвращать 0 при аргументах (0 , 10)',()=>{ // описываем условия
        expect(exponentiation(0,10)) // передаем в функцию параментры
        .toBe(0); // передаем ожидаемый результат 
    })

    
        // null
    it('должна возвращать null при аргументах (null , 2)',()=>{ // описываем условия
        expect(exponentiation(null,2)) // передаем в функцию параментры
        .toBeNull(); // передаем ожидаемый результат 
    })
    it('должна возвращать null при аргументах (5 , null)',()=>{ // описываем условия
        expect(exponentiation(5,null)) // передаем в функцию параментры
        .toBeNull(); // передаем ожидаемый результат 
    })
        // undefined
    it('должна возвращать undefined при аргументах (undefined , 5)',()=>{ // описываем условия
        expect(exponentiation(undefined,5)) // передаем в функцию параментры
        .toBeUndefined() // передаем ожидаемый результат 
    })
    it('должна возвращать undefined при аргументах (5 , undefined)',()=>{ // описываем условия
        expect(exponentiation(5,undefined)) // передаем в функцию параментры
        .toBeUndefined() // передаем ожидаемый результат 
    })
        // NAN
    it('должна возвращать nam при аргументах (5 , "text")',()=>{ // описываем условия
        expect(exponentiation(5,"text")) // передаем в функцию параментры
        .toBeNaN() // передаем ожидаемый результат 
    })
    it('должна возвращать nam при аргументах ( "text" ,5)',()=>{ // описываем условия
        expect(exponentiation("text",5)) // передаем в функцию параментры
        .toBeNaN() // передаем ожидаемый результат 
    })
    
});